int/resources/objectRepo/xmlTemplates/opera/ExternalSystemsConfig/req_CreateExternalSystems.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateExternalSystemsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:ExternalSystemsInfo>
            <v91:ExternalSystemInfo>
               <v91:ExternalSystemHotelCodesList>
                  <v91:ExternalSystemHotelCodes>
                     <v91:HotelCode/>
                     <v91:Inactive/>
                     <v91:ExternalSSOUrl/>
                     <v91:ActionType/>
                     <v91:ConsumerName/>
                  </v91:ExternalSystemHotelCodes>
               </v91:ExternalSystemHotelCodesList>
               <v91:ExternalSystemCode>
                  <v91:Code/>
               </v91:ExternalSystemCode>
               <v91:Description/>
               <v91:DisplaySequence/>
               <v91:LoginValidateUrl/>
               <v91:ExternalSSOUrl/>
               <v91:ExternalUri/>
               <v91:InternalActivityInterface/>
               <v91:Active/>
            </v91:ExternalSystemInfo>
         </v9:ExternalSystemsInfo>
      </v9:CreateExternalSystemsRQ>
   </soapenv:Body>
</soapenv:Envelope>